# 题目：两个 3 行 3 列的矩阵，实现其对应位置的数据相加，并返回一个新矩阵：

# import numpy as np
#
# x = np.array([[1, 5, 8],     # 必须是numpy的数据格式np.array()才可
#      [2, 6, 9],
#      [3, 7, 10]])
#
# y = np.array([[11, 12, 13],
#      [14, 15, 16],
#      [17, 18, 19]])
#
# z = x + y
# print(z)

x = [[1, 5, 8],
     [2, 6, 9],
     [3, 7, 10]]
y = [[11, 12, 13],
     [14, 15, 16],
     [17, 18, 19]]
z = [[0, 0, 0],
     [0, 0, 0],
     [0, 0, 0]]
for i in range(0, 3):
    for j in range(0, 3):
        z[i][j] = x[i][j] + y[i][j]
for k in z:
    print(k)
